src/Catalogs/СценарииАвтоматизации/СценарииАвтоматизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СценарииАвтоматизации</name>
  <attributes>
    <name>РежимВыполнения</name>
    <comment>Предполагает возможность выполнения на одном Агенте нескольких сценариев одновременно</comment>
    <type>
      <types>EnumRef.РежимВыполненияСценария</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставляется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ШагиАвтоматизации</name>
    <attributes>
      <name>НомерШага</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШагРодитель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторШага</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторШагаРодителя</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипШага</name>
      <type>
        <types>EnumRef.ТипыЭлементовСхемыСценария</types>
      </type>
    </attributes>
    <attributes>
      <name>Команда</name>
      <type>
        <types>CatalogRef.КомандыАвтоматизации</types>
      </type>
    </attributes>
    <attributes>
      <name>КомандаОтката</name>
      <type>
        <types>CatalogRef.КомандыАвтоматизации</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонЕдиницыОборудования</name>
      <type>
        <types>CatalogRef.ШаблоныЕдиницАвтоматизации</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачалаШага</name>
      <comment>Если шаг нужно начать не ранее определенного времени после завершения предыдущего</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВключенПоУмолчанию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВключенПоУмолчаниюОткат</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыШаговАвтоматизации</name>
    <attributes>
      <name>УникальныйИдентификаторШага</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДляОтката</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзШаблона</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтурыАдминистрирования</name>
    <comment>Используется для ограничения доступа к данным. Если не выбрано, доступно всем</comment>
    <attributes>
      <name>Контур</name>
      <type>
        <types>CatalogRef.КонтурыАдминистрирования</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШаблоныЗаполненияПараметров</name>
    <attributes>
      <name>ИмяШаблона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособЗаполнения</name>
      <type>
        <types>EnumRef.СпособыЗаполненияПараметровКоманды</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтносительнаяСсылкаНаМетаданные</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УчаствуетВИнтерфейсныхГруппировках</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Объект</name>
      <type>
        <types>String</types>
        <types>CatalogRef</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МетаданныеСвязанныхОбъектов</name>
    <attributes>
      <name>ИмяОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/ТипыЭлементовСхемыСценария/ТипыЭлементовСхемыСценария.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭлементовСхемыСценария</name>
  <enumValues>
    <name>Ветка</name>
  </enumValues>
  <enumValues>
    <name>ВспомогательныеШаги</name>
    <comment>Шаги из данного блока не влияют на успех сценария, не меняют состояние системы, выполняются как фоновые без учета основного режима выполнения сценария</comment>
  </enumValues>
  <enumValues>
    <name>Шаг</name>
  </enumValues>
  <enumValues>
    <name>Разделение</name>
  </enumValues>
  <enumValues>
    <name>Старт</name>
  </enumValues>
  <enumValues>
    <name>Условие</name>
  </enumValues>
  <enumValues>
    <name>Цикл</name>
  </enumValues>
  <enumValues>
    <name>Вариант</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/СценарииАвтоматизации/Forms/ФормаСозданияШага/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("ТипШага", ТипШага);
	Параметры.Свойство("ШаблонЕдиницыОборудования", ШаблонЕдиницыОборудования);
	Параметры.Свойство("Команда", КомандаАвтоматизации);
	Параметры.Свойство("КомандаОтката", КомандаОтката);
	Параметры.Свойство("НомерШага", НомерШага);
	Параметры.Свойство("УникальныйИдентификаторШага", УникальныйИдентификаторШага);
	Параметры.Свойство("Сценарий", Сценарий);
	Параметры.Свойство("Название", Название);
	Для каждого Шаблон Из Параметры.ШаблоныПараметров Цикл
		Строка = ШаблоныПараметров.Добавить();
		Строка.ИмяШаблона = Шаблон.ИмяШаблона;
	КонецЦикла;	
	Если ЗначениеЗаполнено(КомандаАвтоматизации) Тогда
		ПолучитьПараметрыКоманды(Сценарий, УникальныйИдентификаторШага, КомандаАвтоматизации, Ложь);
	КонецЕсли;
	Если ЗначениеЗаполнено(КомандаОтката) Тогда
		ПолучитьПараметрыКоманды(Сценарий, УникальныйИдентификаторШага, КомандаОтката, Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КомандаПриИзмененииНаСервере(Откат = Ложь)
	Если Откат Тогда
		Команда = КомандаОтката;
		ПараметрыДляОбработки = ПараметрыКомандыОтката;
	Иначе	
		Команда = КомандаАвтоматизации;
		ПараметрыДляОбработки = ПараметрыКоманды;
	КонецЕсли;
	
	Если ПустаяСтрока(Название) Тогда
		Название = Команда.Наименование;
	КонецЕсли;
	
	ТЗ = ДанныеФормыВЗначение(ПараметрыДляОбработки, Тип("ТаблицаЗначений"));
	АктуальнаяКопия = ТЗ.Скопировать();
	
	ТЗ.Очистить();
	// обязательные параметры
	ДанныеПараметров = Команда.ПараметрыОбязательные.ВыгрузитьКолонку("ИмяПараметра");
	Для каждого Элемент Из ДанныеПараметров Цикл
		Строка = ТЗ.Добавить();
		Строка.Параметр = Элемент;
		
		СтрокаАктуальнойКопии = АктуальнаяКопия.Найти(Элемент);
		
		Если СтрокаАктуальнойКопии <> Неопределено Тогда
			Строка.Значение = СтрокаАктуальнойКопии.Значение;
			Строка.ИзШаблона = СтрокаАктуальнойКопии.ИзШаблона;
		Иначе	
			Строка.Значение = "";
		КонецЕсли;	
			
		Строка.Обязательный = 0;
	КонецЦикла;	
	
	// дополнительные параметры
	ДанныеПараметров = Команда.ПараметрыДополнительные.ВыгрузитьКолонку("ИмяПараметра");
	Для каждого Элемент Из ДанныеПараметров Цикл
		Строка = ТЗ.Добавить();
		Строка.Параметр = Элемент;
		
		СтрокаАктуальнойКопии = АктуальнаяКопия.Найти(Элемент);
		
		Если СтрокаАктуальнойКопии <> Неопределено Тогда
			Строка.Значение = СтрокаАктуальнойКопии.Значение;
			Строка.ИзШаблона = СтрокаАктуальнойКопии.ИзШаблона;
		Иначе	
			Строка.Значение = "";
		КонецЕсли;	

		Строка.Обязательный = 2;
	КонецЦикла;	

	ТЗ.Сортировать("Обязательный, Параметр");
	
	Если Откат Тогда
		ЗначениеВДанныеФормы(ТЗ, ПараметрыКомандыОтката);
	Иначе	
		ЗначениеВДанныеФормы(ТЗ, ПараметрыКоманды);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПолучитьПараметрыКоманды(Сценарий, УникальныйИдентификаторШага, Команда, ЭтоОткат)
	ТабРезультат = РаботаСоСценариямиАвтоматизацииСервер.ПолучитьПараметрыКоманды(Сценарий, УникальныйИдентификаторШага, Команда, ЭтоОткат);
	
	Если ЭтоОткат Тогда
		ЗначениеВДанныеФормы(ТабРезультат, ПараметрыКомандыОтката);
		ПараметрыКомандыОтката.Сортировать("Обязательный, Параметр");
	Иначе	
		ЗначениеВДанныеФормы(ТабРезультат, ПараметрыКоманды);
		ПараметрыКоманды.Сортировать("Обязательный, Параметр");
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура КомандаПриИзменении(Элемент)
	Модифицированность = Истина;
	
	КомандаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ТипШага", ТипШага);
	ПараметрыЗакрытия.Вставить("ШаблонЕдиницыОборудования", ШаблонЕдиницыОборудования);
	ПараметрыЗакрытия.Вставить("Команда", КомандаАвтоматизации);
	ПараметрыЗакрытия.Вставить("КомандаОтката", КомандаОтката);
	ПараметрыЗакрытия.Вставить("НомерШага", НомерШага);
	ПараметрыЗакрытия.Вставить("УникальныйИдентификаторШага", УникальныйИдентификаторШага);
	ПараметрыЗакрытия.Вставить("ПараметрыКоманды", ПараметрыКоманды);
	ПараметрыЗакрытия.Вставить("ПараметрыКомандыОтката", ПараметрыКомандыОтката);
	ПараметрыЗакрытия.Вставить("Модифицированность", Модифицированность);
	ПараметрыЗакрытия.Вставить("Название", Название);
	
	Закрыть(ПараметрыЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткатаПриИзменении(Элемент)
	Модифицированность = Истина;
	Если Не ЗначениеЗаполнено(КомандаОтката) Тогда
		ПараметрыКомандыОтката.Очистить();
		Элементы.ГруппаПараметрыКомандыОтката.Видимость = Ложь;
	Иначе
		Элементы.ГруппаПараметрыКомандыОтката.Видимость = Истина;
		КомандаПриИзмененииНаСервере(Истина);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокВыбораШаблоновПараметров()
	СписокВыбора = Новый Массив;
	й=0;
	Для каждого ЭлементКоллекции Из ШаблоныПараметров Цикл
		Если ЭлементКоллекции.ИмяШаблона <> "" Тогда
			СписокВыбора.Добавить(ЭлементКоллекции.ИмяШаблона);
			й=й+1;
		КонецЕсли;	
	КонецЦикла;
	
	Элементы.ПараметрыКомандыЗначение.СписокВыбора.ЗагрузитьЗначения(СписокВыбора);
	Элементы.ПараметрыКомандыОткатаЗначение.СписокВыбора.ЗагрузитьЗначения(СписокВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ТипШага = ПредопределенноеЗначение("Перечисление.ТипыЭлементовСхемыСценария.Шаг") Тогда 
		ЗаполнитьСписокВыбораШаблоновПараметров();
	КонецЕсли;	
	УстановитьВидимостьДоступность();	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыКомандыЗначениеПриИзменении(Элемент)
	Модифицированность = Истина;
	ТекДанные = Элемент.Родитель.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если ШаблоныПараметров.НайтиСтроки(Новый Структура("ИмяШаблона", ВРег(ТекДанные.Значение))).Количество() >0 Тогда
			ТекДанные.Значение = ВРег(ТекДанные.Значение);
			ТекДанные.ИзШаблона = Истина
		Иначе
			ТекДанные.ИзШаблона = Ложь;
		КонецЕсли;	
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ТипШагаПриИзменении(Элемент)
	Модифицированность  = Истина;
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ШаблонЕдиницыОборудованияПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НазваниеПриИзменении(Элемент)
	Модифицированность  = Истина;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	Если ТипШага = ПредопределенноеЗначение("Перечисление.ТипыЭлементовСхемыСценария.Шаг") Тогда
		Элементы.ШаблонЕдиницыОборудования.Видимость = Истина;
		Элементы.Команда.Видимость = Истина;
		Элементы.КомандаОтката.Видимость = Истина;
		Элементы.ГруппаПараметрыКоманд.Видимость = Истина;
	Иначе
		Элементы.ШаблонЕдиницыОборудования.Видимость = Ложь;
		Элементы.Команда.Видимость = Ложь;
		Элементы.КомандаОтката.Видимость = Ложь;
		Элементы.ГруппаПараметрыКоманд.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры	
#КонецОбласти
